ch14/ch14-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 14.3</title>
<meta name="author" content="pedh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Chapter 14.3</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org38318a0">14.3</a>
<ul>
<li><a href="#org68f5307">14.3-1</a></li>
<li><a href="#orge7e75a6">14.3-2</a></li>
<li><a href="#org1e588d6">14.3-3</a></li>
<li><a href="#org679c417">14.3-4</a></li>
<li><a href="#org929cf60">14.3-5</a></li>
<li><a href="#org3196dd5">14.3-6</a></li>
<li><a href="#org49b1459">14.3-7</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org38318a0" class="outline-2">
<h2 id="org38318a0">14.3</h2>
<div class="outline-text-2" id="text-org38318a0">
</div>
<div id="outline-container-org68f5307" class="outline-3">
<h3 id="org68f5307">14.3-1</h3>
<div class="outline-text-3" id="text-org68f5307">
<p>
Add following lines after the 12th line in <code>LEFT-ROTATE</code>
</p>
<pre class="example">
y.max = x.max
x.max = MAXIMUM(x.int.high, x.left.max, x.right.max)
</pre>
</div>
</div>
<div id="outline-container-orge7e75a6" class="outline-3">
<h3 id="orge7e75a6">14.3-2</h3>
<div class="outline-text-3" id="text-orge7e75a6">
<pre class="example">
INTERVAL-SEARCH-OPEN(T, i)
    x = T.root
    while x != T.nil and i does not overlap x.int
        // x.left.max == i.low means no overlapping for open interval
        if x.left != T.nil and x.left.max &gt; i.low
            x = x.left
        else x = x.right
    return x
</pre>
</div>
</div>
<div id="outline-container-org1e588d6" class="outline-3">
<h3 id="org1e588d6">14.3-3</h3>
<div class="outline-text-3" id="text-org1e588d6">
<pre class="example">
INTERVAL-SEARCH-MINIMUM(T, i)
    x = T.root
    z = T.nil
    while x != T.nil
        if i overlaps x.int and (x.int.low &lt; z.int.low or z == T.nil)
           z = x
        if x.left != T.nil and x.left.max &gt;= i.low
            x = x.left
        else x = x.right
    return z
</pre>
</div>
</div>
<div id="outline-container-org679c417" class="outline-3">
<h3 id="org679c417">14.3-4</h3>
<div class="outline-text-3" id="text-org679c417">
<pre class="example">
INTERVAL-SEARCH-ALL(T, i)
    let a be an empty array of nodes
    if T.root != T.nil
        INTERVAL-SEARCH-ALL-REC(T, T.root, i, a)
    return a

INTERVAL-SEARCH-ALL-REC(T, x, i, a)
    if i overlaps x.int
        a.append(x)
    if x.left != T.nil and x.left.max &gt;= i.low
        INTERVAL-SEARCH-ALL-REC(T, x.left, i, a)
    if i.low &gt; x.int.high and x.right != T.nil and x.right.max &gt;= i.low
        INTERVAL-SEARCH-ALL-REC(T, x.right, i, a)
</pre>
</div>
</div>
<div id="outline-container-org929cf60" class="outline-3">
<h3 id="org929cf60">14.3-5</h3>
<div class="outline-text-3" id="text-org929cf60">
<p>
We only need to modify the internal red-black tree operations of the
interval-tree, by changing the key of node \(x\) from the low endpoint
\(x.int.low\) to the median \(\frac{x.int.low + x.int.high}{2}\), and if two
intervals have the same median, we compare the low endpoints.
We could implement the <code>INTERVAL-SEARCH-EXACTLY(T, i)</code> as below
</p>
<pre class="example">
INTERVAL-SEARCH-EXACTLY(T, i)
    x = T.root
    while x != T.nil and not (x.i.low == i.low and x.i.high == i.high)
        if (x.i.low + x.i.high) &gt; (i.low + i.high)
            x = x.left
        else if (x.i.low + x.i.high) &lt; (i.low + i.high) or x.i.low &lt; i.low
            x = x.right
        else x = x.left
    return x
</pre>
</div>
</div>
<div id="outline-container-org3196dd5" class="outline-3">
<h3 id="org3196dd5">14.3-6</h3>
<div class="outline-text-3" id="text-org3196dd5">
<p>
We augment the red-black tree, by adding the three <code>max</code>, <code>min</code> and <code>min-gap</code>
attributes to the nodes, and we could maintain the three attributes as below
</p>
<pre class="example">
x.max: The maximum key of nodes in the subtree rooted at x
x.min: The minimum key of nodes in the subtree rooted at x
x.min-gap: The minimum magnitude of the differences of the two closest keys
  in the subtree rooted at x, infinite greatness if x is a leaf node

x.max = x.right.max if x.right != T.nil else x.key
x.min = x.left.min if x.left != T.nil else x.key
x.min-gap = min(x.left.min-gap, x.right.min-gap, x.key - x.left.max,
                x.right.min - x.key)
</pre>
<p>
By <b>Theorem 14.1</b>, we know that the \(O(\lg n)\) running time of the
dynamic set operations are not asymptotically affected, and we could
implement \(O(1)\) running time <code>MIN-GAP</code> by retrieving <code>T.root.min-gap</code>.
</p>
</div>
</div>
<div id="outline-container-org49b1459" class="outline-3">
<h3 id="org49b1459">14.3-7</h3>
<div class="outline-text-3" id="text-org49b1459">
<p>
We represent a rectilinearly oriented rectangle as an object \(r\), with
following attributes
</p>
<pre class="example">
r.x-min: The minimum x-coordinate of the rectangle
r.x-max: The maximum x-coordinate of the rectangle
r.y-min: The minimum y-coordinate of the rectangle
r.y-max: The maximum y-coordinate of the rectangle
</pre>
<p>
We use an <b>interval tree</b> to store the left and right sides of the
rectilinearly oriented rectangles. And we define a new object
<code>rectangle-side</code>, the attributes of <code>rectangle-side</code> object \(s\) are
</p>
<pre class="example">
s.node: The node contains the interval of the side
s.x-coord: The x-coordinate of the side
s.left: The left side of the rectangle, if s contains the right side else NIL
</pre>
<p>
And we could implement an \(O(n\lg n)\)-time algorithm to decide whether a
set of n rectangles contains two rectangles that overlap, as following
</p>
<pre class="example">
RECTANGLES-OVERLAP(rs)
    let T be a new interval tree
    let a be a new array of rectangle-sides
    for r in rs
        let i be a new interval
        let x be a new interval tree node
        let left-side be a new rectangle-side
        let right-side be a new rectangle-side
        i.low = r.y-min
        i.high = r.y-max
        x.int = i
        left-side.node = x
        left-side.x-coord = r.x-min
        left-side.left = NIL
        right-side.x-coord = r.x-max
        right-side.left = left-side
        a.append(left-side)
        a.append(right-side)
    // using asymptotically best running time sort algorithm, like MERGE-SORT
    // or HEAPSORT
    sort a by the x-coord attributes
    for s in a
        // s is the left side, if the interval containing in s overlaps with
        // the intervals in the tree, the rectangle of s overlaps
        if s.left == NIL
            x = INTERVAL-SEARCH(T, s.node.int)
            if x != T.nil
                return true
            // if not overlaps, we insert the interval into the tree
            INTERVAL-INSERT(T, s.node)
        // we delete the interval if s is the right side
        else INTERVAL-DELETE(T, s.left.node)
    return false
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2023-08-17 Thu 10:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>